"===============================================================================Переменные ========================================================================"
# переменные - это именованные ссылки на ячейки памятиб где хранятсякакие то данные для дальнейщего использованияб при обращении к названиию переменной 
num1 = 5 
num2  = 10 
print(num1+num2)


"==========================================================================ВВод и вывод данных======================================================================"
# input  - функция которая принимает данные с терминала 
# print  - Выводить данные с терминала
number = input("Введите число:")
print("Выведенное число-", number)



"                                                                   Правила наименования переменных                                                                  "
 # 1num = 10 #Нельзя начинать с цисел 
 # hello_world = 'Hello world ' # для разделения можно использовать только _
# print = 'print' нельзя называть переменные уже встроенными словами 
# Snake Case - это питоновский стиль написания переменных 

"                                                                          Типы данных                                                                            "
# неизменяемые 
int_ = 17
float_ = 17.15
str_ = ' Hello'
bool_1 = True
bool_2 = False
none_ = None
tuple_ = (1, 2, 3, 4, 5)


# изменяемые 
list_ = [1, 2, 3, 4, 5]
set_ = (1, 2, 1, 4, ) #{1, 2, 4}
dict_ = {'a':1, 'b':2, 'c':3 }


